library-webapp/target/library-webapp-1.0-SNAPSHOT/WEB-INF/classes/user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:us="http://library/soap/web-services">
  <soapenv:Header/>
  <soapenv:Body>
    <us:getUserRequest>
      <us:name>ibra@gmail.com</us:name>
      <us:name>1234</us:name>
    </us:getUserRequest>
  </soapenv:Body>
</soapenv:Envelope>